Repository: pavanTkumar/Kannada_App
Catalog: lib/l10n/app_*.arb
Languages: hi, kn, te

# appName
source: Learn Kannada
hi: कन्नड़ सीखें
kn: ಕನ್ನಡ ಕಲಿ
te: కన్నడ నేర్చుకోండి

source: Home
hi: होम
kn: ಮುಖ್ಯ
te: హోమ్

source: Progress
hi: प्रगति
kn: ಪ್ರಗತಿ
te: పురోగతి

source: Test
hi: परीक्षा
kn: ಪರೀಕ್ಷೆ
te: పరీక్ష

source: Profile
hi: प्रोफ़ाइल
kn: ಪ್ರೊಫೈಲ್
te: ప్రొఫైల్

# welcomeTitle
source: Welcome to Learn Kannada!
hi: कन्नड़ सीखने में आपका स्वागत है!
kn: ಕನ್ನಡ ಕಲಿಕೆಗೆ ಸ್ವಾಗತ!
te: కన్నడ నేర్చుకోవడానికి స్వాగతం!

# welcomeSubtitle
source: Let's set up your learning profile
hi: आइए अपनी सीखने की प्रोफ़ाइल सेट करें
kn: ನಿಮ್ಮ ಕಲಿಕೆಯ ಪ್ರೊಫೈಲ್ ಅನ್ನು ಹೊಂದಿಸೋಣ
te: మీ అభ్యాస ప్రొఫైల్‌ను సెటప్ చేద్దాం

source: What should we call you?
hi: हमें आपको क्या कहना चाहिए?
kn: ನಾವು ನಿಮ್ಮನ್ನು ಏನು ಎಂದು ಕರೆಯಬೇಕು?
te: మేము మిమ్మల్ని ఏం అని పిలవాలి?

# personalizeExperience
source: We'll use this to personalize your experience
hi: हम इसका उपयोग आपके अनुभव को व्यक्तिगत बनाने के लिए करेंगे
kn: ನಿಮ್ಮ ಅನುಭವವನ್ನು ವೈಯಕ್ತಿಕಗೊಳಿಸಲು ನಾವು ಇದನ್ನು ಬಳಸುತ್ತೇವೆ
te: మీ అనుభవాన్ని వ్యక్తిగతీకరించడానికి మేము దీన్ని ఉపయోగిస్తాము

source: Your Name
hi: आपका नाम
kn: ನಿಮ್ಮ ಹೆಸರು
te: మీ పేరు

# nameHint
source: E.g., John, Ravi, Priya...
hi: जैसे: राम, सीता, अमित...
kn: ಉದಾ: ರಾಮ, ಸೀತಾ, ಅಮಿತ್...
te: ఉదా: రామ్, సీత, అమిత్...

# nameValidation
source: Please enter your name
hi: कृपया अपना नाम दर्ज करें
kn: ದಯವಿಟ್ಟು ನಿಮ್ಮ ಹೆಸರನ್ನು ನಮೂದಿಸಿ
te: దయచేసి మీ పేరు నమోదు చేయండి

# nameMinLength
source: Name must be at least 2 characters
hi: नाम कम से कम 2 अक्षर का होना चाहिए
kn: ಹೆಸರು ಕನಿಷ್ಠ 2 ಅಕ್ಷರಗಳಾಗಿರಬೇಕು
te: పేరు కనీసం 2 అక్షరాలు ఉండాలి

# choosePreferredLanguage
source: Choose your preferred language
hi: अपनी पसंदीदा भाषा चुनें
kn: ನಿಮ್ಮ ಆದ್ಯತೆಯ ಭಾಷೆಯನ್ನು ಆಯ್ಕೆ ಮಾಡಿ
te: మీ ఇష్టపడే భాషను ఎంచుకోండి

# translationsInLanguage
source: We'll show translations in this language
hi: हम इस भाषा में अनुवाद दिखाएंगे
kn: ನಾವು ಈ ಭಾಷೆಯಲ್ಲಿ ಅನುವಾದಗಳನ್ನು ತೋರಿಸುತ್ತೇವೆ
te: మేము ఈ భాషలో అనువాదాలను చూపుతాము

# almostThere
source: Almost there, {name}!
hi: लगभग पूरा हो गया, {name}!
kn: ಸುಮಾರು ಮುಗಿಯಿತು, {name}!
te: దాదాపు పూర్తయింది, {name}!

# reviewPreferences
source: Review your preferences and start learning
hi: अपनी प्राथमिकताओं की समीक्षा करें और सीखना शुरू करें
kn: ನಿಮ್ಮ ಆದ್ಯತೆಗಳನ್ನು ಪರಿಶೀಲಿಸಿ ಮತ್ತು ಕಲಿಕೆಯನ್ನು ಪ್ರಾರಂಭಿಸಿ
te: మీ ప్రాధాన్యతలను సమీక్షించండి మరియు నేర్చుకోవడం ప్రారంభించండి

source: Name
hi: नाम
kn: ಹೆಸರು
te: పేరు

source: Language
hi: भाषा
kn: ಭಾಷೆ
te: భాష

source: Dark Mode
hi: डार्क मोड
kn: ಡಾರ್ಕ್ ಮೋಡ್
te: డార్క్ మోడ్

source: Enable dark theme
hi: डार्क थीम सक्षम करें
kn: ಡಾರ್ಕ್ ಥೀಮ್ ಸಕ್ರಿಯಗೊಳಿಸಿ
te: డార్క్ థీమ్‌ను ప్రారంభించండి

# changeSettingsAnytime
source: You can change these settings anytime from your profile
hi: आप इन सेटिंग्स को अपनी प्रोफ़ाइल से कभी भी बदल सकते हैं
kn: ನೀವು ಈ ಸೆಟ್ಟಿಂಗ್ಗಳನ್ನು ನಿಮ್ಮ ಪ್ರೊಫೈಲ್ನಿಂದ ಯಾವಾಗ ಬೇಕಾದರೂ ಬದಲಾಯಿಸಬಹುದು
te: మీరు ఈ సెట్టింగ్‌లను మీ ప్రొఫైల్ నుండి ఎప్పుడైనా మార్చవచ్చు

source: Get Started
hi: शुरू करें
kn: ಪ್ರಾರಂಭಿಸಿ
te: ప్రారంభించండి

source: Next
hi: अगला
kn: ಮುಂದೆ
te: తదుపరి

source: Back
hi: वापस
kn: ಹಿಂದೆ
te: వెనుకకు

source: Previous
hi: पिछला
kn: ಹಿಂದಿನ
te: మునుపటి

source: Kannada Basics
hi: कन्नड़ मूल बातें
kn: ಕನ್ನಡ ಮೂಲತತ್ವಗಳು
te: కన్నడ ప్రాథమికాలు

source: Practical Phrases
hi: व्यावहारिक वाक्य
kn: ಪ್ರಾಯೋಗಿಕ ವಾಕ್ಯಗಳು
te: ఆచరణీయ వాక్యాలు

source: Your Learning Progress
hi: आपकी सीखने की प्रगति
kn: ನಿಮ್ಮ ಕಲಿಕೆಯ ಪ್ರಗತಿ
te: మీ అభ్యాస పురోగతి

# keepGoingGreat
source: Keep going! You're doing great
hi: जारी रखें! आप बहुत अच्छा कर रहे हैं
kn: ಮುಂದುವರಿಸಿ! ನೀವು ಚೆನ್ನಾಗಿ ಮಾಡುತ್ತಿದ್ದೀರಿ
te: కొనసాగించండి! మీరు బాగా చేస్తున్నారు

source: Cards Learned
hi: कार्ड सीखे गए
kn: ಕಾರ್ಡ್ಗಳು ಕಲಿತು
te: కార్డులు నేర్చుకున్నారు

source: Avg. Progress
hi: औसत प्रगति
kn: ಸರಾಸರಿ ಪ್ರಗತಿ
te: సగటు పురోగతి

source: Quizzes Done
hi: क्विज़ पूरे किए
kn: ಪ್ರಶ್ನೋತ್ತರಗಳು ಪೂರ್ಣ
te: క్విజ్‌లు పూర్తి చేశారు

source: Your Progress
hi: आपकी प्रगति
kn: ನಿಮ್ಮ ಪ್ರಗತಿ
te: మీ పురోగతి

source: Test Your Knowledge
hi: अपने ज्ञान का परीक्षण करें
kn: ನಿಮ್ಮ ಜ್ಞಾನವನ್ನು ಪರೀಕ್ಷಿಸಿ
te: మీ జ్ఞానాన్ని పరీక్షించండి

# quizzesToTestProgress
source: Take quizzes to test your Kannada learning progress
hi: अपनी कन्नड़ सीखने की प्रगति का परीक्षण करने के लिए क्विज़ लें
kn: ನಿಮ್ಮ ಕನ್ನಡ ಕಲಿಕೆಯ ಪ್ರಗತಿಯನ್ನು ಪರೀಕ್ಷಿಸಲು ಪ್ರಶ್ನೋತ್ತರಗಳನ್ನು ತೆಗೆದುಕೊಳ್ಳಿ
te: మీ కన్నడ అభ్యాస పురోగతిని పరీక్షించడానికి క్విజ్‌లు తీసుకోండి

source: Not started
hi: शुरू नहीं हुआ
kn: ಪ್ರಾರಂಭವಾಗಿಲ್ಲ
te: ప్రారంభించలేదు

# scorePercent
source: {score}% Score
hi: {score}% स्कोर
kn: {score}% ಅಂಕ
te: {score}% స్కోర్

source: questions
hi: प्रश्न
kn: ಪ್ರಶ್ನೆಗಳು
te: ప్రశ్నలు

source: Learning Statistics
hi: सीखने के आंकड़े
kn: ಕಲಿಕೆಯ ಅಂಕಿಅಂಶಗಳು
te: అభ్యాస గణాంకాలు

source: Flashcards Learned
hi: फ्लैशकार्ड सीखे गए
kn: ಫ್ಲಾಶ್ಕಾರ್ಡ್ಗಳು ಕಲಿತು
te: ఫ్లాష్‌కార్డులు నేర్చుకున్నారు

source: Quizzes Completed
hi: क्विज़ पूर्ण किए गए
kn: ಪ್ರಶ್ನೋತ್ತರಗಳು ಪೂರ್ಣಗೊಂಡಿವೆ
te: క్విజ్‌లు పూర్తయ్యాయి

source: Average Quiz Score
hi: औसत क्विज़ स्कोर
kn: ಸರಾಸರಿ ಪ್ರಶ್ನೋತ್ತರ ಅಂಕ
te: సగటు క్విజ్ స్కోర్

source: Achievements
hi: उपलब्धियां
kn: ಸಾಧನೆಗಳು
te: విజయాలు

source: No achievements yet
hi: अभी तक कोई उपलब्धि नहीं
kn: ಇನ್ನೂ ಯಾವುದೇ ಸಾಧನೆಗಳಿಲ್ಲ
te: ఇంకా విజయాలు లేవు

# keepLearningEarnAchievements
source: Keep learning to earn achievements!
hi: उपलब्धियां अर्जित करने के लिए सीखते रहें!
kn: ಸಾಧನೆಗಳನ್ನು ಗಳಿಸಲು ಕಲಿಯುತ್ತಲೇ ಇರಿ!
te: విజయాలు సాధించడానికి నేర్చుకుంటూ ఉండండి!

source: Personal Information
hi: व्यक्तिगत जानकारी
kn: ವೈಯಕ್ತಿಕ ಮಾಹಿತಿ
te: వ్యక్తిగత సమాచారం

source: Preferred Language
hi: पसंदीदा भाषा
kn: ಆದ್ಯತೆಯ ಭಾಷೆ
te: ఇష్టపడే భాష

source: App Information
hi: ऐप जानकारी
kn: ಅಪ್ಲಿಕೇಶನ್ ಮಾಹಿತಿ
te: యాప్ సమాచారం

source: Version
hi: संस्करण
kn: ಆವೃತ್ತಿ
te: వెర్షన్

source: On
hi: चालू
kn: ಆನ್
te: ఆన్

source: Off
hi: बंद
kn: ಆಫ್
te: ఆఫ్

# dayStreak
source: {days} Day Streak
hi: {days} दिन की लकीर
kn: {days} ದಿನಗಳ ಸರಣಿ
te: {days} రోజుల మాల

source: Vowels
hi: स्वर
kn: ಸ್ವರಗಳು
te: అచ్చులు

source: Consonants
hi: व्यंजन
kn: ವ್ಯಂಜನಗಳು
te: హల్లులు

source: Numbers
hi: संख्याएं
kn: ಸಂಖ್ಯೆಗಳು
te: సంఖ్యలు

source: Greetings
hi: अभिवादन
kn: ಶುಭಾಶಯಗಳು
te: శుభాకాంక్షలు

source: Daily Phrases
hi: दैनिक वाक्य
kn: ದೈನಂದಿನ ವಾಕ್ಯಗಳು
te: రోజువారీ వాక్యాలు

source: Food & Drinks
hi: भोजन और पेय
kn: ಆಹಾರ ಮತ್ತು ಪಾನೀಯಗಳು
te: ఆహారం మరియు పానీయాలు

# vowelsDescription
source: Learn the basic vowels in Kannada alphabet
hi: कन्नड़ वर्णमाला में मूल स्वर सीखें
kn: ಕನ್ನಡ ವರ್ಣಮಾಲೆಯಲ್ಲಿ ಮೂಲ ಸ್ವರಗಳನ್ನು ಕಲಿಯಿರಿ
te: కన్నడ వర్ణమాలలో ప్రాథమిక అచ్చులను నేర్చుకోండి

# consonantsDescription
source: Master the basic consonants in Kannada
hi: कन्नड़ में मूल व्यंजन में महारत हासिल करें
kn: ಕನ್ನಡದಲ್ಲಿ ಮೂಲ ವ್ಯಂಜನಗಳನ್ನು ಕರಗತ ಮಾಡಿಕೊಳ್ಳಿ
te: కన్నడలో ప్రాథమిక హల్లులను నైపుణ్యం పొందండి

# numbersDescription
source: Learn counting in Kannada
hi: कन्नड़ में गिनती सीखें
kn: ಕನ್ನಡದಲ್ಲಿ ಎಣಿಕೆ ಕಲಿಯಿರಿ
te: కన్నడలో లెక్కింపు నేర్చుకోండి

# greetingsDescription
source: Common greetings and expressions
hi: सामान्य अभिवादन और अभिव्यक्तियां
kn: ಸಾಮಾನ್ಯ ಶುಭಾಶಯಗಳು ಮತ್ತು ಅಭಿವ್ಯಕ್ತಿಗಳು
te: సాధారణ శుభాకాంక్షలు మరియు వ్యక్తీకరణలు

# dailyPhrasesDescription
source: Essential phrases for everyday conversations
hi: रोजमर्रा की बातचीत के लिए आवश्यक वाक्य
kn: ದೈನಂದಿನ ಸಂಭಾಷಣೆಗಳಿಗೆ ಅಗತ್ಯವಾದ ವಾಕ್ಯಗಳು
te: రోజువారీ సంభాషణలకు అవసరమైన వాక్యాలు

# foodDrinksDescription
source: Learn about food and drinks in Kannada
hi: कन्नड़ में भोजन और पेय के बारे में सीखें
kn: ಕನ್ನಡದಲ್ಲಿ ಆಹಾರ ಮತ್ತು ಪಾನೀಯಗಳ ಬಗ್ಗೆ ಕಲಿಯಿರಿ
te: కన్నడలో ఆహారం మరియు పానీయాల గురించి నేర్చుకోండి

source: Complete
hi: पूर्ण
kn: ಪೂರ್ಣ
te: పూర్తి

# cardOf
source: Card {current} of {total}
hi: कार्ड {current} में से {total}
kn: ಕಾರ್ಡ್ {current} / {total}
te: కార్డు {current} / {total}

source: learned
hi: सीखा गया
kn: ಕಲಿತು
te: నేర్చుకున్నారు

source: Kannada
hi: कन्नड़
kn: ಕನ್ನಡ
te: కన్నడ

source: English
hi: अंग्रेजी
kn: ಇಂಗ್ಲಿಷ್
te: ఇంగ్లిష్

source: Tap card to flip
hi: फ्लिप करने के लिए कार्ड पर टैप करें
kn: ಪಲ್ಟಿಸಲು ಕಾರ್ಡ್ ಮೇಲೆ ಟ್ಯಾಪ್ ಮಾಡಿ
te: తిప్పడానికి కార్డుపై ట్యాప్ చేయండి

source: Mark as Learned
hi: सीखे गए के रूप में चिह्नित करें
kn: ಕಲಿತದ್ದಾಗಿ ಗುರುತಿಸಿ
te: నేర్చుకున్నట్లు గుర్తించండి

source: Reset
hi: रीसेट
kn: ಮರುಹೊಂದಿಸಿ
te: రీసెట్

source: How to Use Flashcards
hi: फ्लैशकार्ड का उपयोग कैसे करें
kn: ಫ್ಲಾಶ್ಕಾರ್ಡ್ಗಳನ್ನು ಹೇಗೆ ಬಳಸುವುದು
te: ఫ్లాష్‌కార్డులను ఎలా ఉపయోగించాలి

# tapCardToFlipInfo
source: Tap card to flip
hi: फ्लिप करने के लिए कार्ड पर टैप करें
kn: ಪಲ್ಟಿಸಲು ಕಾರ್ಡ್ ಮೇಲೆ ಟ್ಯಾಪ್ ಮಾಡಿ
te: తిప్పడానికి కార్డుపై ట్యాప్ చేయండి

source: Mark cards as learned
hi: कार्ड को सीखे गए के रूप में चिह्नित करें
kn: ಕಾರ್ಡ್ಗಳನ್ನು ಕಲಿತದ್ದಾಗಿ ಗುರುತಿಸಿ
te: కార్డులను నేర్చుకున్నట్లు గుర్తించండి

source: Practice regularly
hi: नियमित रूप से अभ्यास करें
kn: ನಿಯಮಿತವಾಗಿ ಅಭ್ಯಾಸ ಮಾಡಿ
te: క్రమం తప్పకుండా అభ్యసించండి

source: Got it
hi: समझ गया
kn: ಅರ್ಥವಾಯಿತು
te: అర్థమైంది

source: Quiz Results
hi: क्विज़ परिणाम
kn: ಪ್ರಶ್ನೋತ್ತರ ಫಲಿತಾಂಶಗಳು
te: క్విజ్ ఫలితాలు

# excellentMaster
source: Excellent! You're a Kannada master!
hi: बहुत बढ़िया! आप कन्नड़ के मास्टर हैं!
kn: ಅತ್ಯುತ್ತಮ! ನೀವು ಕನ್ನಡದ ಮಾಸ್ಟರ್!
te: అద్భుతం! మీరు కన్నడ మాస్టర్!

# greatJobLearning
source: Great job! You're learning well!
hi: बहुत अच्छा काम! आप अच्छी तरह सीख रहे हैं!
kn: ಬಹುತೇಕ ಚೆನ್ನಾಗಿದೆ! ನೀವು ಚೆನ್ನಾಗಿ ಕಲಿಯುತ್ತಿದ್ದೀರಿ!
te: గొప్ప పని! మీరు బాగా నేర్చుకుంటున్నారు!

source: Good effort! Keep practicing!
hi: अच्छा प्रयास! अभ्यास जारी रखें!
kn: ಒಳ್ಳೆಯ ಪ್ರಯತ್ನ! ಅಭ್ಯಾಸ ಮುಂದುವರಿಸಿ!
te: మంచి ప్రయత్నం! అభ్యాసం కొనసాగించండి!

# keepTryingImprove
source: Keep trying! You'll improve with practice!
hi: कोशिश करते रहें! अभ्यास से आप सुधार करेंगे!
kn: ಪ್ರಯತ್ನಿಸುತ್ತಲೇ ಇರಿ! ಅಭ್ಯಾಸದಿಂದ ನೀವು ಸುಧಾರಿಸುತ್ತೀರಿ!
te: ప్రయత్నిస్తూ ఉండండి! అభ్యాసంతో మీరు మెరుగుపడతారు!

source: Question Summary
hi: प्रश्न सारांश
kn: ಪ್ರಶ್ನೆ ಸಾರಾಂಶ
te: ప్రశ్న సారాంశం

source: Back to Quizzes
hi: क्विज़ पर वापस
kn: ಪ್ರಶ್ನೋತ್ತರಗಳಿಗೆ ಹಿಂತಿರುಗಿ
te: క్విజ్‌లకు తిరిగి వెళ్ళండి

source: Score
hi: स्कोर
kn: ಅಂಕ
te: స్కోర్

source: Question {number}
hi: प्रश्न {number}
kn: ಪ್ರಶ್ನೆ {number}
te: ప్రశ్న {number}

# correctAnswer
source: Correct answer: {answer}
hi: सही उत्तर: {answer}
kn: ಸರಿಯಾದ ಉತ್ತರ: {answer}
te: సరైన సమాధానం: {answer}

# questionNumberOfTotal
source: Question {current}/{total}
hi: प्रश्न {current}/{total}
kn: ಪ್ರಶ್ನೆ {current}/{total}
te: ప్రశ్న {current}/{total}

source: Check Answer
hi: उत्तर जांचें
kn: ಉತ್ತರ ಪರಿಶೀಲಿಸಿ
te: సమాధానం తనిఖీ చేయండి

source: Next Question
hi: अगला प्रश्न
kn: ಮುಂದಿನ ಪ್ರಶ್ನೆ
te: తదుపరి ప్రశ్న

source: See Results
hi: परिणाम देखें
kn: ಫಲಿತಾಂಶಗಳನ್ನು ನೋಡಿ
te: ఫలితాలను చూడండి
